`timescale 1ns / 1ps
//////////////////////////////////////////////////////////////////////////////////
//计算PC
//一般情况下，指令顺序执行，PC每次加4（一条指令4字节）
//跳转时，PC更新为跳转地址
//////////////////////////////////////////////////////////////////////////////////
module PCC(
input[31:0]         PC,//当前PC
output[31:0]        next_PC,//下一拍的PC

input               EXE2IF_j_sig,//执行级给出的跳转标志位
input[31:0]         EXE2IF_j_PC//跳转地址
    );

MUX2#(.WIDTH(32))PC_VALUE(
.D0(PC + 'b100),.D1(EXE2IF_j_PC),.A(EXE2IF_j_sig),.Y(next_PC)
);
endmodule
